# FamilyInstanceCreationData Constructor (Object) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstanceCreationData Constructor (Object)
FamilyInstanceCreationData Class See Also
---
Initializes a new instance of the FamilyInstanceCreationData class
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyInstanceCreationData(
	Object proxy
)
```

Visual Basic
---
```text
Public Sub New ( _
	proxy As Object _
)
```

Visual C++
---
```text
public:
FamilyInstanceCreationData(
	Object^ proxy
)
```

# ### Parameters
proxy
    Type: System..::..Object
# See Also
FamilyInstanceCreationData Class
FamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace